cf_billing/InformationRegisters/энргСреднийОбъемПотребленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСреднийОбъемПотребленияМКД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРасчетСреднегоОбъемаМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасчетСреднегоОбъемаМКД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъемУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСПриборомУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОткрытиеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргСменаПоставщикаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияСУслугамиМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргУстановитьВидДифференцированностиПриборУчетаМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПоказанийМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСреднийОбъемПотребленияМКД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет средний объем потребления МКД.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция СреднийОбъемПотребленияМКД(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСреднийОбъемПотребленияМКД());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;		
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ИменаТаблиц 				= Новый Структура("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		ДоступныеПараметры 			= Новый Структура;
		ДоступныеПараметры.Вставить("СреднийОбъемПотребления","Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона");
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, "СреднийОбъемПотребления", ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);		
	КонецЕсли;
	
КонецФункции

// Заполняет средний объем потребления МКД коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаПериодов		-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура СреднийОбъемПотребленияМКДКоллекцияПериодов(Схема, ПараметрыОтбора, ТаблицаПериодов, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТексЗапросаСреднийОбъемПотребленияМКДКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, ПериодНачисления, Район, МКД, Услуга, ТочкаУчета, Шкала, ТарифнаяЗона";
		ИмяТаблицы 					= "СреднийОбъемПотребленияМКД";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор, ИмяТаблицы, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);				
	КонецЕсли;	 	
	
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

// Актуализирует данные среднего объема.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  МКД					-	СправочникСсылка.энргСтроения.
//
Процедура АктуализироватьДанныеСреднегоОбъема(Организация, ПериодНачисления, Район, МКД=Неопределено) Экспорт
	
	Набор  		= СоздатьНаборЗаписей();
	Набор.Отбор.Организация.установить(Организация);
	Набор.Отбор.ПериодНачисления.установить(ПериодНачисления);
	Набор.Отбор.Район.установить(Район);
	Если НЕ МКД = Неопределено Тогда
		Набор.Отбор.МКД.установить(МКД);
	КонецЕсли;  
	
	Набор.Записать();
	
	Результат   = РегистрыСведений.энргРасчетСреднегоОбъемаМКД.РезультатаЗапросаСреднегоПотребленияМКД(Организация, ПериодНачисления, Район);
	Выборка 	= Результат.Выбрать();
	Набор  		= СоздатьНаборЗаписей();				 
	Пока Выборка.следующий() цикл
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);		
	КонецЦикла;
	
	Набор.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса на получение среднего объема потребления МКД.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаСреднийОбъемПотребленияМКД() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребления.Организация КАК Организация,
	|	СреднийОбъемПотребления.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребления.Район КАК Район,
	|	СреднийОбъемПотребления.МКД КАК МКД,
	|	СреднийОбъемПотребления.Услуга КАК Услуга,
	|	СреднийОбъемПотребления.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребления.Шкала КАК Шкала,
	|	СреднийОбъемПотребления.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребления.Объем КАК Объем,
	|	СреднийОбъемПотребления.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК СреднийОбъемПотребления";
	
	Возврат Текст;
	
КонецФункции

// Получает текст запроса на получение среднего объема потребления МКД коллекция периодов.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТексЗапросаСреднийОбъемПотребленияМКДКоллекцияПериодов() Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	СреднийОбъемПотребленияМКД.Организация КАК Организация,
	|	СреднийОбъемПотребленияМКД.ПериодНачисления КАК ПериодНачисления,
	|	СреднийОбъемПотребленияМКД.Район КАК Район,
	|	СреднийОбъемПотребленияМКД.МКД КАК МКД,
	|	СреднийОбъемПотребленияМКД.Услуга КАК Услуга,
	|	СреднийОбъемПотребленияМКД.ТочкаУчета КАК ТочкаУчета,
	|	СреднийОбъемПотребленияМКД.Шкала КАК Шкала,
	|	СреднийОбъемПотребленияМКД.ТарифнаяЗона КАК ТарифнаяЗона,
	|	СреднийОбъемПотребленияМКД.Объем КАК Объем,
	|	СреднийОбъемПотребленияМКД.ОбъемПотребленный КАК ОбъемПотребленный
	|ИЗ
	|	РегистрСведений.энргСреднийОбъемПотребленияМКД КАК СреднийОбъемПотребленияМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО СреднийОбъемПотребленияМКД.Организация = ТаблицаПериодов.Организация
	|			И СреднийОбъемПотребленияМКД.Район = ТаблицаПериодов.Район
	|			И СреднийОбъемПотребленияМКД.ПериодНачисления = ТаблицаПериодов.ПериодНачисления";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
